# Data Wrangling

## Introduction
Data wrangling is a broad term used, often informally, to describe the process of transforming raw data to a clean and organized format ready for use.

The most common data structure used to "wrangle" data is the data frame, which can be both intuitive and incredibly versatile. Data frames are tabular, meaning that they are based on rows and columns like you'd find in a spreadsheet.

## 1 Creating a Data Frame

In [1]:
import pandas as pd
df = pd.DataFrame()

#df., #df.mean?, #shift-tab

## 2 Describing the Data

In [35]:
filename = 'titanic.csv'
df = pd.read_csv(filename)
# show first two rows
df.head(2) # also try tail(2) for last two rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.28,C85,C

In [3]:
# show dimensions
print("Dimensions: {}".format(df.shape))

Dimensions: (891, 12)

In [7]:
pd.options.display.precision = 2

In [8]:
# show statistics
df.describe()

       PassengerId  Survived  Pclass     Age   SibSp   Parch    Fare
count       891.00    891.00  891.00  714.00  891.00  891.00  891.00
mean        446.00      0.38    2.31   29.70    0.52    0.38   32.20
std         257.35      0.49    0.84   14.53    1.10    0.81   49.69
min           1.00      0.00    1.00    0.42    0.00    0.00    0.00
25%         223.50      0.00    2.00   20.12    0.00    0.00    7.91
50%         446.00      0.00    3.00   28.00    0.00    0.00   14.45
75%         668.50      1.00    3.00   38.00    1.00    0.00   31.00
max         891.00      1.00    3.00   80.00    8.00    6.00  512.33

In [6]:
type(df.describe())

pandas.core.frame.DataFrame

In [10]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## 3 Navigating DataFrames

In [11]:
# select the first row
df.iloc[0]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                               22.0
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [ ]:
# select three rows
df.iloc[1:4]

In [ ]:
# all rows up to and including the fourth row
df.iloc[:4]

DataFrames do not need to be numerically indexed. We can set the index of a DataFrame to any value where the value is unique to each row. For example, we can set the index to be passenger names and then select rows using a name:

In [ ]:
# Set index
df2 = df.set_index(df['Name'])

# Show row
df2.loc['Palsson, Master. Gosta Leonard']

### Discussion
All rows in a pandas DataFrame have a unique index value.  By default, this index is an integer indicating the row position in the DataFrame; however, it does not have to be.  DataFrame indexes can be set to be unique alphanumeric strings or customer numbers.  To select individual rows and slices of rows, pandas provides two methods: 

* `loc` is useful when the index of the DataFrame is a label (a string)
* `iloc` works by looking for the position in the DataFrame. For example, `iloc[0]` will return the first row regardless of whether the index is an integer or a label

## 4 Selecting Rows Based on Conditionals

In [39]:
# select top two rows where column 'sex' is 'female'
df[df['Sex'] == 'female'].head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.28,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.92,NaN,S

In [ ]:
# multiple conditions
df[(df['Sex'] == 'female') & (df['Age'] >= 62)]

In [13]:
df['Sex'].head(3)

0      male
1    female
2    female
Name: Sex, dtype: object

In [24]:
df.iloc[2]

PassengerId                         3
Survived                            1
Pclass                              3
Name           Heikkinen, Miss. Laina
Sex                            female
Age                              26.0
SibSp                               0
Parch                               0
Ticket               STON/O2. 3101282
Fare                             7.92
Cabin                             NaN
Embarked                            S
Name: 2, dtype: object

## 5 Replacing Values

In [36]:
# replace any instance of 'female' with Woman
df['Sex'].replace('female', 'Woman').head(2)

0     male
1    Woman
Name: Sex, dtype: object

In [37]:
# replace 'female'  and 'male with 'Woman' and 'Man'
df2 = df['Sex'].replace(['female', 'male'], ['Woman', 'Man'])
df2.head(4)

0      Man
1    Woman
2    Woman
3    Woman
Name: Sex, dtype: object

In [29]:
# Find and replace across whole DataFrame
df.replace(1, "One").head(2)

0      Man
1    Woman
Name: Sex, dtype: object

## 6 Renaming Columns

In [38]:
df.rename(columns={'Pclass': 'Passenger Class'}).head(2)

,PassengerId,Survived,Passenger Class,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.28,C85,C

In [ ]:
df.rename(columns={'Pclass': 'Passenger Class', 'Sex': 'Gender'}).head(2)

In [ ]:
df.head(4)

## 7 Finding the Min, Max, Sum, Average, and Count

In [ ]:
print('Maximum: {}'.format(df['Age'].max()))
print('Minimum: {}'.format(df['Age'].min()))
print('Mean: {}'.format(df['Age'].mean()))
print('Sum: {}'.format(df['Age'].sum()))
print('Count: {}'.format(df['Age'].count()))

In addition to these, pandas also offers variance (`var`), standard deviation (`std`), kurtosis (`kurt`), skewness (`skew`), and a number of others.

We can also apply these methods to whole dataframes

In [40]:
print("Variance: {}".format(df.var()))
print("Standard Deviation: {}".format(df.std()))
print("Kurtosis: {}".format(df.kurt()))
print("Skewness: {}".format(df.skew()))

Variance: PassengerId    66231.00
Survived           0.24
Pclass             0.70
Age              211.02
SibSp              1.22
Parch              0.65
Fare            2469.44
dtype: float64
Standard Deviation: PassengerId    257.35
Survived         0.49
Pclass           0.84
Age             14.53
SibSp            1.10
Parch            0.81
Fare            49.69
dtype: float64
Kurtosis: PassengerId    -1.20
Survived       -1.78
Pclass         -1.28
Age             0.18
SibSp          17.88
Parch           9.78
Fare           33.40
dtype: float64
Skewness: PassengerId    0.00
Survived       0.48
Pclass        -0.63
Age            0.39
SibSp          3.70
Parch          2.75
Fare           4.79
dtype: float64

C:\Users\UACIS\AppData\Local\Temp/ipykernel_23084/2781515079.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print("Variance: {}".format(df.var()))
C:\Users\UACIS\AppData\Local\Temp/ipykernel_23084/2781515079.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print("Standard Deviation: {}".format(df.std()))
C:\Users\UACIS\AppData\Local\Temp/ipykernel_23084/2781515079.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print("Kurtosis: {}".format(df.kurt()))
C:\Users\UACIS\AppData\Local\Temp/ipykernel_23084/2781515079.py:4: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  print("Skewness: {}".format(df.skew()))

## 8 Finding Unique Values

In [41]:
# unique will return an array of all unique values in a column
df['Sex'].unique()

array(['male', 'female'], dtype=object)

In [42]:
# value_counts will display all unique values with the number of times each value appears
df['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

## 9 Handling Missing Values

In [48]:
# select missing values, show 5 rows
df[df['Age'].isnull()].size

2124

In [44]:
# Drop rows with Nan values
df2 = df.dropna() # removes rows with any NaN values
df2 = df2.reset_index()
df2.head(10)

,index,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.28,C85,C
1,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.10,C123,S
2,6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.86,E46,S
3,10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.70,G6,S
4,11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.55,C103,S
5,21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.00,D56,S
6,23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.50,A6,S
7,27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.00,C23 C25 C27,S
8,52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.73,D33,C
9,54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.98,B30,C

## 10 Deleting a Column

In [ ]:
# axis=1 means the column axis
df.drop('Age', axis=1).head(2)

## 11 Deleting a Row

In [ ]:
# create new dataframe excluding the rows you want to delete
df[df['Sex'] != 'male'].head(2)

In [ ]:
# delete a row by matching a unique value
df[df['Name'] != 'Braund, Mr. Owen Harris'].head(2)

In [ ]:
# delete a row by index
df[df.index != 0].head(2)

## 12 Looping Over a Column

In [ ]:
# for .. in .. loop
for name in df['Name'][0:2]:
    print(name.upper())

In [50]:
[df['Name'].head(5)]

[0                              Braund, Mr. Owen Harris
 1    Cumings, Mrs. John Bradley (Florence Briggs Th...
 2                               Heikkinen, Miss. Laina
 3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
 4                             Allen, Mr. William Henry
 Name: Name, dtype: object]

In [ ]:
# list comprehension (more "pythonic")
[name.upper() for name in df['Name'][0:2]]

## 3.13 Applying a Function Over All Elements in a Column

### Discussion
`apply` is a great way to do data cleaning and wrangling. It is common to write a function to perform some useful operation (separate first and last names, convert string to floats, etc) and then map that funtion to every element in a column.

In [54]:
# Create function
def uppercase(x):
    return x.upper()

df['Name'].apply(str.upper)[0:2]

0                              BRAUND, MR. OWEN HARRIS
1    CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
Name: Name, dtype: object

### See Also
* pandas' documentation on merging (https://pandas.pydata.org/pandas-docs/stable/merging.html)